Repository: zanggu4/StockHUD
Catalog: StockHUD/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, zh_hans

source: API Provider
de: API-Anbieter
es: Proveedor de API
fr: Fournisseur d'API
ja: APIプロバイダ
ko: API 제공자
zh_hans: API 提供方

source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter
ja: 追加
ko: 추가
zh_hans: 添加

source: Adds live prices for the 8PM–4AM ET overnight session, which neither Webull nor Yahoo carries. Free Alpaca paper-trading keys work. Leave empty to disable.
de: Ergänzt Live-Kurse für die Overnight-Sitzung von 20–4 Uhr ET, die weder Webull noch Yahoo bietet. Kostenlose Alpaca-Paper-Trading-Schlüssel genügen. Leer lassen zum Deaktivieren.
es: Añade precios en vivo de la sesión nocturna (20:00–4:00 ET), que ni Webull ni Yahoo ofrecen. Sirven claves gratuitas de paper trading de Alpaca. Déjalo vacío para desactivar.
fr: Ajoute les cours en direct de la séance de nuit (20h–4h ET), absente de Webull et Yahoo. Les clés gratuites de paper trading Alpaca suffisent. Laisser vide pour désactiver.
ja: Webull・Yahoo にはない米東部時間 20:00〜4:00 のオーバーナイト・セッションのリアルタイム価格を追加します。Alpaca の無料ペーパートレード用キーで動作します。空欄で無効。
ko: Webull과 Yahoo 모두 제공하지 않는 미 동부시간 20:00~04:00 오버나잇 세션의 실시간 가격을 추가합니다. Alpaca 무료 페이퍼 트레이딩 키로 동작합니다. 비워두면 비활성화됩니다.
zh_hans: 为 Webull 与 Yahoo 均不提供的美东时间 20:00–4:00 夜盘时段添加实时价格。Alpaca 免费模拟交易密钥即可使用。留空则停用。

source: Alpaca API Key
de: Alpaca-API-Schlüssel
es: Clave de API de Alpaca
fr: Clé d'API Alpaca
ja: Alpaca APIキー
ko: Alpaca API 키
zh_hans: Alpaca API 密钥

source: Alpaca Secret Key
de: Geheimer Alpaca-Schlüssel
es: Clave secreta de Alpaca
fr: Clé secrète Alpaca
ja: Alpaca シークレットキー
ko: Alpaca 시크릿 키
zh_hans: Alpaca 私密密钥

source: Always On Top
de: Immer im Vordergrund
es: Siempre visible
fr: Toujours au premier plan
ja: 常に最前面
ko: 항상 위에 표시
zh_hans: 总在最前

source: Behavior
de: Verhalten
es: Comportamiento
fr: Comportement
ja: 動作
ko: 동작
zh_hans: 行为

source: Check Update Automatically
de: Automatisch nach Updates suchen
es: Buscar actualizaciones automáticamente
fr: Vérifier les mises à jour automatiquement
ja: 自動アップデート確認
ko: 자동 업데이트 확인
zh_hans: 自动检查更新

source: Click Through (Ignore Mouse Events)
de: Klick-Durchreichung (Mausereignisse ignorieren)
es: Clic a través (ignorar eventos del ratón)
fr: Clic à travers (ignorer les événements souris)
ja: クリック透過（マウスイベント無視）
ko: 클릭 통과 (마우스 이벤트 무시)
zh_hans: 点击穿透（忽略鼠标事件）

source: Corner Radius
de: Eckenradius
es: Radio de esquinas
fr: Rayon des coins
ja: 角丸
ko: 모서리 둥글기
zh_hans: 圆角

source: Display
de: Anzeige
es: Pantalla
fr: Affichage
ja: 表示
ko: 표시
zh_hans: 显示

source: Display Mode
de: Anzeigemodus
es: Modo de visualización
fr: Mode d'affichage
ja: 表示モード
ko: 표시 모드
zh_hans: 显示模式

source: Double-Click Opens
de: Doppelklick öffnet
es: Doble clic abre
fr: Double-clic ouvre
ja: ダブルクリックで開く
ko: 더블클릭으로 열기
zh_hans: 双击打开

source: Down Color
de: Farbe bei Kursverlust
es: Color de bajada
fr: Couleur de baisse
ja: 下落色
ko: 하락 색상
zh_hans: 下跌颜色

source: Flat Color
de: Farbe unverändert
es: Color neutro
fr: Couleur neutre
ja: 変わらず色
ko: 보합 색상
zh_hans: 平盘颜色

source: Font Family
de: Schriftart
es: Fuente
fr: Police
ja: フォント
ko: 글꼴
zh_hans: 字体

source: Font Size
de: Schriftgröße
es: Tamaño de fuente
fr: Taille de police
ja: 文字サイズ
ko: 글자 크기
zh_hans: 字号

source: General
de: Allgemein
fr: Général
ja: 一般
ko: 일반
zh_hans: 通用

source: Hide HUD
de: HUD ausblenden
es: Ocultar HUD
fr: Masquer le HUD
ja: HUDを隠す
ko: HUD 숨기기
zh_hans: 隐藏 HUD

source: Large
de: Groß
es: Grande
fr: Grand
ja: 大
ko: 크게
zh_hans: 大

source: Launch at Login
de: Bei Anmeldung starten
es: Abrir al iniciar sesión
fr: Lancer à la connexion
ja: ログイン時に起動
ko: 로그인 시 실행
zh_hans: 登录时启动

source: Line Spacing
de: Zeilenabstand
es: Interlineado
fr: Interligne
ja: 行間
ko: 줄 간격
zh_hans: 行距

source: Loading…
de: Lädt…
es: Cargando…
fr: Chargement…
ja: 読み込み中…
ko: 불러오는 중…
zh_hans: 加载中…

source: Lock Position
de: Position sperren
es: Bloquear posición
fr: Verrouiller la position
ja: 位置をロック
ko: 위치 잠금
zh_hans: 锁定位置

source: Medium
de: Mittel
es: Mediano
fr: Moyen
ja: 中
ko: 중간
zh_hans: 中

source: No symbols — right-click to open Settings
de: Keine Symbole – Rechtsklick öffnet Einstellungen
es: Sin símbolos: clic derecho para abrir Ajustes
fr: Aucun symbole — clic droit pour ouvrir les Réglages
ja: 銘柄なし — 右クリックで設定を開く
ko: 종목 없음 — 우클릭으로 설정 열기
zh_hans: 无代码 — 右键打开设置

source: Opacity
de: Deckkraft
es: Opacidad
fr: Opacité
ja: 不透明度
ko: 불투명도
zh_hans: 不透明度

source: Padding
de: Innenabstand
es: Relleno
fr: Marge intérieure
ja: 余白
ko: 여백
zh_hans: 内边距

source: Quit StockHUD
de: StockHUD beenden
es: Salir de StockHUD
fr: Quitter StockHUD
ja: StockHUDを終了
ko: StockHUD 종료
zh_hans: 退出 StockHUD

source: Refresh Interval
de: Aktualisierungsintervall
es: Intervalo de actualización
fr: Intervalle d'actualisation
ja: 更新間隔
ko: 갱신 주기
zh_hans: 刷新间隔

source: Refresh Now
de: Jetzt aktualisieren
es: Actualizar ahora
fr: Actualiser maintenant
ja: 今すぐ更新
ko: 지금 갱신
zh_hans: 立即刷新

source: Remove Symbol
de: Symbol entfernen
es: Eliminar símbolo
fr: Supprimer le symbole
ja: 銘柄を削除
ko: 종목 삭제
zh_hans: 移除代码

source: Settings…
de: Einstellungen…
es: Ajustes…
fr: Réglages…
ja: 設定…
ko: 설정…
zh_hans: 设置…

source: Shadow
de: Schatten
es: Sombra
fr: Ombre
ja: 影
ko: 그림자
zh_hans: 阴影

source: Show HUD
de: HUD anzeigen
es: Mostrar HUD
fr: Afficher le HUD
ja: HUDを表示
ko: HUD 표시
zh_hans: 显示 HUD

source: Show on All Spaces
de: In allen Spaces anzeigen
es: Mostrar en todos los espacios
fr: Afficher sur tous les bureaux
ja: すべての操作スペースに表示
ko: 모든 Space에 표시
zh_hans: 在所有空间显示

source: Show over Fullscreen Apps
de: Über Vollbild-Apps anzeigen
es: Mostrar sobre apps a pantalla completa
fr: Afficher au-dessus des apps plein écran
ja: フルスクリーンアプリの上に表示
ko: 전체 화면 앱 위에 표시
zh_hans: 显示在全屏应用之上

source: Size
de: Größe
es: Tamaño
fr: Taille
ja: サイズ
ko: 크기
zh_hans: 大小

source: Small
de: Klein
es: Pequeño
fr: Petit
ja: 小
ko: 작게
zh_hans: 小

source: Start Hidden
de: Versteckt starten
es: Iniciar oculto
fr: Démarrer masqué
ja: 非表示で開始
ko: 숨김 상태로 시작
zh_hans: 启动时隐藏

source: Switch to Detail Mode
de: Zum Detailmodus wechseln
es: Cambiar a modo detallado
fr: Passer en mode détaillé
ja: 詳細モードに切替
ko: 상세 모드로 전환
zh_hans: 切换到详细模式

source: Switch to Mini Mode
de: Zum Minimodus wechseln
es: Cambiar a modo mini
fr: Passer en mode mini
ja: ミニモードに切替
ko: 미니 모드로 전환
zh_hans: 切换到迷你模式

source: Symbol (e.g. AAPL, BTC-USD)
de: Symbol (z. B. AAPL, BTC-USD)
es: Símbolo (p. ej. AAPL, BTC-USD)
fr: Symbole (ex. AAPL, BTC-USD)
ja: シンボル（例: AAPL, BTC-USD）
ko: 심볼 (예: AAPL, BTC-USD)
zh_hans: 代码（如 AAPL、BTC-USD）

source: Symbols
de: Symbole
es: Símbolos
fr: Symboles
ja: 銘柄
ko: 종목
zh_hans: 代码

source: Up Color
de: Farbe bei Kursgewinn
es: Color de subida
fr: Couleur de hausse
ja: 上昇色
ko: 상승 색상
zh_hans: 上涨颜色

source: Update
de: Aktualisierung
es: Actualización
fr: Mise à jour
ja: 更新
ko: 업데이트
zh_hans: 更新

source: Webull (extended hours, batch)
de: Webull (erweiterte Handelszeiten, Batch)
es: Webull (horario extendido, lote)
fr: Webull (heures étendues, lot)
ja: Webull（時間外対応・一括）
ko: Webull (시간외 포함, 배치 요청)
zh_hans: Webull（含盘前盘后，批量）

source: Webull covers pre-market / after-hours prices and falls back to Yahoo for symbols it doesn't carry (e.g. crypto). Neither carries the overnight session.
de: Webull liefert Pre-Market-/After-Hours-Kurse; für nicht verfügbare Symbole (z. B. Krypto) wird Yahoo verwendet. Keiner von beiden bietet die Overnight-Sitzung.
es: Webull cubre precios pre-market y after-hours; para símbolos que no tiene (p. ej. cripto) usa Yahoo. Ninguno cubre la sesión nocturna.
fr: Webull couvre les cours pre-market/after-hours ; pour les symboles absents (ex. crypto), Yahoo est utilisé. Aucun des deux ne couvre la séance de nuit.
ja: Webullはプレ・アフターマーケット価格に対応し、扱いのないシンボル（例: 仮想通貨）はYahooを使用します。 どちらもオーバーナイト・セッションには対応していません。
ko: Webull은 프리장/애프터장 가격을 지원하며, 없는 심볼(예: 크립토)은 자동으로 Yahoo를 사용합니다. 둘 다 오버나잇 세션은 지원하지 않습니다.
zh_hans: Webull 支持盘前/盘后价格；不支持的代码（如加密货币）将自动使用 Yahoo。 两者均不支持夜盘时段。

source: When enabled, the HUD cannot be clicked or dragged. Turn it off here to interact again.
de: Wenn aktiviert, kann das HUD nicht angeklickt oder verschoben werden. Zum Reaktivieren hier ausschalten.
es: Al activarlo, el HUD no se puede pulsar ni arrastrar. Desactívalo aquí para volver a interactuar.
fr: Une fois activé, le HUD ne peut plus être cliqué ni déplacé. Désactivez-le ici pour interagir à nouveau.
ja: オンにするとHUDのクリックやドラッグができなくなります。再度操作するにはここでオフにしてください。
ko: 켜면 HUD를 클릭하거나 드래그할 수 없습니다. 다시 사용하려면 여기서 끄세요.
zh_hans: 开启后将无法点击或拖动 HUD。如需恢复交互，请在此处关闭。

source: Yahoo Finance (regular hours)
de: Yahoo Finance (reguläre Handelszeiten)
es: Yahoo Finance (horario regular)
fr: Yahoo Finance (heures régulières)
ja: Yahoo Finance（通常時間のみ）
ko: Yahoo Finance (정규장만)
zh_hans: Yahoo Finance（仅常规时段）

source: Yahoo Finance symbols: stocks (NVDA), crypto (BTC-USD), indices (^GSPC), FX (KRW=X)
de: Yahoo-Finance-Symbole: Aktien (NVDA), Krypto (BTC-USD), Indizes (^GSPC), Devisen (KRW=X)
es: Símbolos de Yahoo Finance: acciones (NVDA), cripto (BTC-USD), índices (^GSPC), divisas (KRW=X)
fr: Symboles Yahoo Finance : actions (NVDA), crypto (BTC-USD), indices (^GSPC), devises (KRW=X)
ja: Yahoo Financeシンボル: 株式（NVDA）、仮想通貨（BTC-USD）、指数（^GSPC）、為替（KRW=X）
ko: Yahoo Finance 심볼: 주식(NVDA), 크립토(BTC-USD), 지수(^GSPC), 환율(KRW=X)
zh_hans: Yahoo Finance 代码：股票（NVDA）、加密货币（BTC-USD）、指数（^GSPC）、外汇（KRW=X）

source: Detail
es: Detallado
fr: Détaillé
ja: 詳細
ko: 상세
zh_hans: 详细

source: Mini
ja: ミニ
ko: 미니
zh_hans: 迷你
